In [17]:
import pandas as pd
import numpy as np

In [54]:
df1 = pd.DataFrame({
    'name':['김','나','박','이'],
    'dept':['연구개발','영업','인사','연구개발']
})

In [55]:
df1

  name  dept
0    김  연구개발
1    나    영업
2    박    인사
3    이  연구개발

In [56]:
df2 = pd.DataFrame({
    'emp_name':['나','종','김','김'],
    'project':['S','D','A','S']
})

In [57]:
df2

  emp_name project
0        나       S
1        종       D
2        김       A
3        김       S

In [58]:
pd.merge(df1,df2, left_on='name', right_on='emp_name').drop('emp_name', axis=1)

  name  dept project
0    김  연구개발       A
1    김  연구개발       S
2    나    영업       S

In [59]:
df1

  name  dept
0    김  연구개발
1    나    영업
2    박    인사
3    이  연구개발

In [60]:
df2

  emp_name project
0        나       S
1        종       D
2        김       A
3        김       S

In [61]:
pd.merge(df1,df2, how='outer', left_on='name', right_on='emp_name').drop('emp_name', axis=1)

  name  dept project
0    김  연구개발       A
1    김  연구개발       S
2    나    영업       S
3    박    인사     NaN
4    이  연구개발     NaN
5  NaN   NaN       D

In [64]:
import random
names = ['a','b','c','d','e']
hit = [random.randint(1,10) for i in range(5)]

In [65]:
hit_rate = pd.DataFrame({
    '이름':names,
    '안타':hit
})

In [66]:
hit_rate

  이름  안타
0  a   1
1  b   4
2  c   3
3  d   6
4  e   6

In [67]:
hit_rate['타석']=hit_rate['안타']+random.randint(0,21)

In [68]:
hit_rate

  이름  안타  타석
0  a   1  18
1  b   4  21
2  c   3  20
3  d   6  23
4  e   6  23

In [69]:
hit_rate['타율']=hit_rate['안타']/hit_rate['타석']

In [70]:
hit_rate

  이름  안타  타석        타율
0  a   1  18  0.055556
1  b   4  21  0.190476
2  c   3  20  0.150000
3  d   6  23  0.260870
4  e   6  23  0.260870